app/Controllers/Home.php

    function tampil()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('sppd');
        $query = $builder->get();
---
SELECT *
FROM `sppd`