app/Controllers/Quiz.php

SELECT *
FROM `jual`
---
    function tampil() // Menampilkan data dari database
    {
        $db = \Config\Database::connect();
        $builder = $db->table('jual'); //nama tabel di database
        $query = $builder->get();

INSERT INTO `jual` (`kode`, `jenis`, `hrgsm`, `jml`, `hrgs`) VALUES ('s002', 'Samki', '10000000', '4', '2500000')
---
    public function simpan() //menyimpan data pada database
    {
        $db = \Config\Database::connect();
        $data = [
            'kode' => $this->request->getPost('kode'), // memanggil name pada form dengan method post
            'jenis' => $this->request->getPost('jenis'),
            'hrgsm' => $this->request->getPost('hargasm'),
            'jml' => $this->request->getPost('jumlah'),
            'hrgs' => $this->request->getPost('hargas'),
        ];
        $simpan = $db->table('jual')->insert($data);